[
    {
        "id": 1,
        "name": "Website creation",
        "mainImg":"/media/vue-logo-1.png",
        "link": "/",
        "description":"My Wordpress portfolio wasn't to my liking thus I decided to create this website from scratch and to learn VueJS on the way, thanks to its online documentation and a lot of Google searches. All of this website's animations are done in CSS and helped by the 'transition' tag from Vue. The only JS used here (except Vue) is for the page's navigation.",

        "skills": {
          "skills_needed": [
              { "name": "logo html", "img": "/media/html.svg" },
              { "name": "logo css", "img": "/media/css.svg" },
              { "name" : "logo javascript", "img":"/media/javascript.svg"},
              { "name" : "logo Vue JS", "img":"/media/Vue-logo-1.png"}
          ]
        }
    },
    {
      "id": 2,
      "name": "Creation of the 'csesmi.fr' website for the Social and Economic Comitee of Accor SMI",
      "mainImg":"/media/wordpress.svg",
      "link": "https://www.csesmi.fr/",
      "description":"During my first 2 month internship, I had to create the website for the Social and Economic Comitee of Accor SM, using Wordpress, a lot of CSS and Woocommerce. Morevover, I had to teach their staff how to use the website's functionalities such such as handling the orders and how to manage the articles and comments. <- Lastly, I am now in charge of the maintenance, IT support and updating the website as a freelancer for Accor SMI].",
     
      "skills": {
        "skills_needed": [
            { "name": "logo css3", "img": "/media/css.svg" },
            { "name": "logo wordpress", "img": "/media/wordpress.svg" }
        ]
    }
    },
    {
      "id": 3,
      "name": "Matrix style website creation",
      "mainImg":"/media/logo.png",
      "link": "https://hackervase.netlify.app/",
      "description":"I had as an instruction to transform a common object into a 'hacker' accesory. I have been able to use this projet to learn how to correctly use ::before and ::after pseudo-elements. The website is not responsive as it was not a part of the assignment and the time constraint didn't allow me to improve it as much as I had wished for.",
      
      "skills": {
        "skills_needed": [
            { "name": "logo html", "img": "/media/html.svg" },
            { "name": "logo css3", "img": "/media/css.svg" },
            { "name": "logo javascript", "img": "/media/javascript.svg" }
        ]
      }
  },
  {
    "id":4,
    "name": "Creation of a Discord bot",
    "mainImg":"/media/python.svg",
    "description":"As a way of furthering my python skills, I had decided to create a discord bot. This bot was used to get a preview of any Instagram post (both the post's text and the image, through Selenium) that were linked on a server, before Instagram had a link preview of it's own. The bot also functioned as a moderation bot, as it detected any swear words sent by users. The admins could also add new swear words to censor, only for their server. This was done thanks to a SQLite Database, and through an SQL injection proof code.",
    "skills": {
      "skills_needed": [
          { "name": "logo python", "img": "/media/python.svg" },
          { "name": "logo sqlite", "img": "/media/sqlite.png" }
      ]
    }
}

     
  ]