[
    {
        "id": 1,
        "name": "Création de ce site web",
        "mainImg":"/media/vue-logo-1.png",
        "link": "/",
        "description":"Mon portfolio WordPress n'étant pas à mon goût, j'ai décidé de faire ce site entièrement à la main et d'apprendre VueJS au passage, grâce à la documentation et à beaucoup de recherches sur Google. Toutes les animations de ce site sont en CSS et facilitées par la balise 'transition' de Vue. Le seul Javascript (hors VueJS) présent est utilisé pour les changement de page.",
        "skills": {
          "skills_needed": [
              { "name": "logo html", "img": "/media/html.svg" },
              { "name": "logo css", "img": "/media/css.svg" },
              { "name" : "logo javascript", "img":"/media/javascript.svg"},
              { "name" : "logo Vue JS", "img":"/media/Vue-logo-1.png"}
          ]
        }
    },
    {
      "id": 2,
      "name": "Création du site 'csesmi.fr' pour le CSE d'Accor SMI",
      "mainImg":"/media/wordpress.svg",
      "link": "https://www.csesmi.fr/",
      "description":"Lors de mon premier stage de deux mois, j'avais pour mission de créer le site du CSE d'Accor SMI, à l'aide de WordPress, de beaucoup de CSS et de Woocommerce. De plus, j'avais aussi pour mission de former leurs équipes à l'utilisation du-dit site (Gestion d'articles, support à faire, gérer les commandes). <+Enfin, j'assure désormais la maintenance, le support et la vie du site en freelance pour Accor SMI].",
      "skills": {
        "skills_needed": [
            { "name": "logo css3", "img": "/media/css.svg" },
            { "name": "logo wordpress", "img": "/media/wordpress.svg" }
        ]
    }
    },
    {
      "id": 3,
      "name": "Création d'un site au style Matrix",
      "mainImg":"/media/logo.png",
      "link": "https://hackervase.netlify.app/",
      "description":"J'avais comme consigne de transformer un objet banal en accesoire de hacker. J'ai pu utiliser ce projet pour apprendre à me servir correctement des elements ::before et ::after. Le responsive n'a pas encore été paufiné car le temps de rendu du projet était court.",
      "skills": {
        "skills_needed": [
            { "name": "logo html", "img": "/media/html.svg" },
            { "name": "logo css3", "img": "/media/css.svg" },
            { "name": "logo javascript", "img": "/media/javascript.svg" }
        ]
      }
  },
  {
    "id":4,
    "name": "Création d'un bot discord",
    "mainImg":"/media/python.svg",
    "description":"Afin d'approfondir mes connaissances en python, j'ai décidé de créer un bot discord. Ce dernier permettait d'afficher des images venant d'un lien instagram (via Selenium) et de permettre à chaque administrateur de définir des mots à bannir sur leurs serveurs. Afin de garder en mémoire chaque configuration et listes de mots à bannir de chaque serveur, une base de données en SQLite a été mise en place et le code a été pensé afin d'éviter les injections SQL.",
    "skills": {
      "skills_needed": [
          { "name": "logo python", "img": "/media/python.svg" },
          { "name": "logo sqlite", "img": "/media/sqlite.png" }
      ]
    }
}

     
  ]